DataProcessors/МониторСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МониторСверкиВзаиморасчетов/Forms/ДокументыНеПолученныеПоЭДО/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Локализация
	СтатусыЭДО = Обработки.МониторСверкиВзаиморасчетов.СтатусыЭДООбменЗавершен();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СостояниеВерсииЭД", СтатусыЭДО, ВидСравненияКомпоновкиДанных.НеВСписке,,Истина);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПриСозданииНаСервере = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка();
	ПараметрыПриСозданииНаСервере.Форма = ЭтотОбъект;
	ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.ПодменюЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	//-- Локализация
	Если ЗначениеЗаполнено("НачалоПериода") И ЗначениеЗаполнено("КонецПериода") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаДокументаИБ", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Параметры.НачалоПериода,,Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаДокументаИБ", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, КонецДня(Параметры.КонецПериода),,Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено("Контрагент") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Контрагент", Параметры.Контрагент, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если Поле.Имя <> "СписокПредставлениеСостояния" Тогда
		ОткрытьЗначениеАсинх(ТекущаяСтрока.Ссылка);
	//++ Локализация
	ИначеЕсли Поле.Имя = "СписокПредставлениеСостояния" Тогда
		КомандаЭДО = НайтиКомандуТекущиеДелаЭДО();
		Если КомандаЭДО <> Неопределено Тогда
			ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(КомандаЭДО, ЭтотОбъект, Элементы.Список);
		КонецЕсли;
	//-- Локализация
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация
&НаКлиенте
Функция НайтиКомандуТекущиеДелаЭДО()
	
	КнопкаТекущиеДелаЭДО = Неопределено;
	КомандаЭДО = Неопределено;
	Если Элементы.ПодменюЭДО.ПодчиненныеЭлементы.Найти("ПодменюЭДОКомандыЭДОДополнительное") <> Неопределено Тогда
		Для Каждого Элемент Из Элементы.ПодменюЭДО.ПодчиненныеЭлементы.ПодменюЭДОКомандыЭДОДополнительное.ПодчиненныеЭлементы Цикл
			Если СтрНайти(Элемент.Имя, "ПодменюЭДООткрытьТекущиеДелаЭДО") > 0 Тогда
				КнопкаТекущиеДелаЭДО = Элемент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если КнопкаТекущиеДелаЭДО <> Неопределено Тогда
		КомандаЭДО = Команды.Найти(КнопкаТекущиеДелаЭДО.ИмяКоманды);
	КонецЕсли;
	
	Возврат КомандаЭДО;
	
КонецФункции
//-- Локализация

#КонецОбласти
